SoMa-Project/IMU/Firmware/firmware.cydsn/Generated_Source/PSoC3/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.1
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2017 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "CLOCK_UART.h"
#include "ISR_RS485_RX.h"
#include "RS_485_EN.h"
#include "RS_485_EN_aliases.h"
#include "FF_STATUS.h"
#include "UART_RS485.h"
#include "EEPROM.h"
#include "USB_VDD.h"
#include "USB_VDD_aliases.h"
#include "FTDI_ENABLE.h"
#include "FTDI_ENABLE_aliases.h"
#include "RS485_CTS.h"
#include "Bootloadable.h"
#include "FTDI_ENABLE_REG.h"
#include "RESET_FF.h"
#include "MY_TIMER.h"
#include "timer_clock.h"
#include "PACER_TIMER.h"
#include "SPI_IMU.h"
#include "SPI_IMU_PVT.h"
#include "MISO.h"
#include "MISO_aliases.h"
#include "MOSI.h"
#include "MOSI_aliases.h"
#include "SCLK.h"
#include "SCLK_aliases.h"
#include "Chip_Select_A.h"
#include "CS01.h"
#include "CS01_aliases.h"
#include "CS02.h"
#include "CS02_aliases.h"
#include "CS03.h"
#include "CS03_aliases.h"
#include "CS04.h"
#include "CS04_aliases.h"
#include "CS05.h"
#include "CS05_aliases.h"
#include "CS06.h"
#include "CS06_aliases.h"
#include "CS07.h"
#include "CS07_aliases.h"
#include "CS08.h"
#include "CS08_aliases.h"
#include "CS09.h"
#include "CS09_aliases.h"
#include "CS10.h"
#include "CS10_aliases.h"
#include "CS11.h"
#include "CS11_aliases.h"
#include "CS12.h"
#include "CS12_aliases.h"
#include "CS13.h"
#include "CS13_aliases.h"
#include "CS14.h"
#include "CS14_aliases.h"
#include "CS15.h"
#include "CS15_aliases.h"
#include "CS16.h"
#include "CS16_aliases.h"
#include "CS00.h"
#include "CS00_aliases.h"
#include "Opto_Pin.h"
#include "Opto_Pin_aliases.h"
#include "Chip_Select_B.h"
#include "ADC_SOC.h"
#include "DMA_dma.h"
#include "AInput_2.h"
#include "AInput_2_aliases.h"
#include "AInput_1.h"
#include "AInput_1_aliases.h"
#include "ADC.h"
#include "ADC_STATUS.h"
#include "SPI_IMU_IntClock.h"
#include "ADC_AMux.h"
#include "ADC_Ext_CP_Clk.h"
#include "ADC_IRQ.h"
#include "ADC_theACLK.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"
#include "PSoC3_8051.h"

/*[]*/

